Hello, now it forces replacement also on plan...

```terraform
  # module.ovh_managed_kubernetes.ovh_vrack.vrack must be replaced
-/+ resource "ovh_vrack" "vrack" {
      ~ id             = "pn-REDACTED" -> (known after apply)
        name           = "REDACTED"
      + ovh_subsidiary = "FR" # forces replacement
      ~ service_name   = "pn-REDACTED" -> (known after apply)
      ~ urn            = "urn:v1:eu:resource:vrack:pn-REDACTED" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ order (known after apply)

      + plan { # forces replacement
          + duration     = (known after apply)
          + plan_code    = "vrack"
          + pricing_mode = (known after apply)
        }
    }
```